chensy5525/MOCE_SDK_ESP32WROOM/components_ch32/ch32_vl53l4cd_gateway/ch32_vl53l4cd_gateway.c
#include "ch32_vl53l4cd_gateway.h"
#include <stdio.h>
#include <string.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#define TAG "VL53L4CD"
#define REG_OSC_FREQUENCY 0x0006U
#define REG_VHV_TIMEOUT 0x0008U
#define REG_GPIO_MUX 0x0030U
#define REG_GPIO_STATUS 0x0031U
#define REG_RANGE_CONFIG_A 0x005EU
#define REG_RANGE_CONFIG_B 0x0061U
#define REG_INTERMEASUREMENT 0x006CU
#define REG_INTERRUPT_CLEAR 0x0086U
#define REG_SYSTEM_START 0x0087U
#define REG_RANGE_STATUS 0x0089U
#define REG_DISTANCE 0x0096U
#define REG_FIRMWARE_STATUS 0x00E5U
#define REG_MODEL_ID 0x010FU
#define POLL_MS 5U
#define LOG_INF(f,...) printf("[INF][" TAG "] " f "\n",##__VA_ARGS__)
#define LOG_ERR(f,...) printf("[ERR][" TAG "] " f "\n",##__VA_ARGS__)
#define TRY(x) do{int r_=(x);if(r_!=0)return r_;}while(0)
typedef struct vl53l4cd_ctx{bool in_use,initialized;ch32_i2c_multi_node_t*node;uint8_t addr;uint32_t bridge_timeout_ms,ready_timeout_ms;}vl53l4cd_ctx_t;
static vl53l4cd_ctx_t s_instances[VL53L4CD_MAX_BRIDGE_INSTANCES];
static const uint8_t s_default_config[]={0x12,0x00,0x00,0x11,0x02,0x00,0x02,0x08,0x00,0x08,0x10,0x01,0x01,0x00,0x00,0x00,0x00,0xFF,0x00,0x0F,0x00,0x00,0x00,0x00,0x00,0x20,0x0B,0x00,0x00,0x02,0x14,0x21,0x00,0x00,0x05,0x00,0x00,0x00,0x00,0xC8,0x00,0x00,0x38,0xFF,0x01,0x00,0x08,0x00,0x00,0x01,0xCC,0x07,0x01,0xF1,0x05,0x00,0xA0,0x00,0x80,0x08,0x38,0x00,0x00,0x00,0x00,0x0F,0x89,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01,0x07,0x05,0x06,0x06,0x00,0x00,0x02,0xC7,0xFF,0x9B,0x00,0x00,0x00,0x01,0x00,0x00};
static void delay_ms(uint32_t ms){TickType_t t=pdMS_TO_TICKS(ms);vTaskDelay(t?t:1U);}static int valid_node(const ch32_i2c_multi_node_t*n){return n&&n->ready&&n->token&&n->device_type==CH32_I2C_MULTI_DYN_DEVICE_TYPE_I2C&&n->node_id>=1U&&n->node_id<=0x20U?0:ERR_INVALID_PARAM;}
static int map_gateway(ch32_i2c_multi_result_t r){switch(r){case CH32_I2C_MULTI_RESULT_OK:return 0;case CH32_I2C_MULTI_RESULT_TIMEOUT:return ERR_TIMEOUT;case CH32_I2C_MULTI_RESULT_BUSY:return ERR_BUSY;case CH32_I2C_MULTI_RESULT_INVALID_ARG:return ERR_INVALID_PARAM;case CH32_I2C_MULTI_RESULT_NODE_NOT_FOUND:return ERR_NO_DEVICE;default:return ERR_VL53L4CD_COMM;}}
static int write_data(vl53l4cd_ctx_t*c,uint16_t reg,const uint8_t*data,size_t len){uint8_t b[136];if(len+2U>sizeof(b))return ERR_OVERFLOW;b[0]=(uint8_t)(reg>>8);b[1]=(uint8_t)reg;memcpy(b+2,data,len);ch32_i2c_multi_result_t g=CH32_I2C_MULTI_RESULT_COMM_FAIL;for(uint32_t i=0;i<VL53L4CD_MAX_RETRIES;i++){if(valid_node(c->node))return ERR_NO_DEVICE;g=ch32_i2c_multi_write_multi_to(c->node,c->addr,b,(uint8_t)(len+2U));if(g==CH32_I2C_MULTI_RESULT_OK)return 0;delay_ms(2U);}LOG_ERR("downstream write FAIL token=0x%04X node=%u reg=0x%04X result=%s",c->node->token,c->node->node_id,reg,ch32_i2c_multi_result_text(g));return map_gateway(g);}
static int read_data(vl53l4cd_ctx_t*c,uint16_t reg,uint8_t*data,uint8_t len){uint8_t idx[2]={(uint8_t)(reg>>8),(uint8_t)reg};ch32_i2c_multi_result_t g=CH32_I2C_MULTI_RESULT_COMM_FAIL;for(uint32_t i=0;i<VL53L4CD_MAX_RETRIES;i++){if(valid_node(c->node))return ERR_NO_DEVICE;g=ch32_i2c_multi_write_read_to(c->node,c->addr,idx,2U,data,len);if(g==CH32_I2C_MULTI_RESULT_OK)return 0;delay_ms(2U);}LOG_ERR("downstream read FAIL token=0x%04X node=%u reg=0x%04X result=%s",c->node->token,c->node->node_id,reg,ch32_i2c_multi_result_text(g));return map_gateway(g);}
static int w8(vl53l4cd_ctx_t*c,uint16_t r,uint8_t v){return write_data(c,r,&v,1U);}static int w16(vl53l4cd_ctx_t*c,uint16_t r,uint16_t v){uint8_t d[2]={(uint8_t)(v>>8),(uint8_t)v};return write_data(c,r,d,2U);}static int w32(vl53l4cd_ctx_t*c,uint16_t r,uint32_t v){uint8_t d[4]={(uint8_t)(v>>24),(uint8_t)(v>>16),(uint8_t)(v>>8),(uint8_t)v};return write_data(c,r,d,4U);}static int r8(vl53l4cd_ctx_t*c,uint16_t r,uint8_t*v){return read_data(c,r,v,1U);}static int r16(vl53l4cd_ctx_t*c,uint16_t r,uint16_t*v){uint8_t d[2];TRY(read_data(c,r,d,2U));*v=((uint16_t)d[0]<<8)|d[1];return 0;}
static int data_ready(vl53l4cd_ctx_t*c,bool*ready){uint8_t mux,status;TRY(r8(c,REG_GPIO_MUX,&mux));TRY(r8(c,REG_GPIO_STATUS,&status));*ready=(status&1U)==(((mux>>4U)&1U)?0U:1U);return 0;}static int wait_ready(vl53l4cd_ctx_t*c,uint32_t timeout){for(uint32_t e=0;e<timeout;e+=POLL_MS){bool ready;TRY(data_ready(c,&ready));if(ready)return 0;delay_ms(POLL_MS);}return ERR_VL53L4CD_DATA_NOT_READY;}
static int set_timing(vl53l4cd_ctx_t*c,uint32_t ms){uint16_t osc,exp=0;uint32_t budget,macro,val,tmp;TRY(r16(c,REG_OSC_FREQUENCY,&osc));if(!osc)return ERR_INVALID_PARAM;budget=ms*1000U-2500U;macro=(uint32_t)(((uint64_t)2304U*(0x40000000ULL/osc))>>6U);budget<<=12U;tmp=macro*16U;val=((budget+((tmp>>6U)>>1U))/(tmp>>6U))-1U;while(val&0xFFFFFF00U){val>>=1U;exp++;}TRY(w16(c,REG_RANGE_CONFIG_A,(uint16_t)((exp<<8U)|(val&0xFFU))));exp=0;tmp=macro*12U;val=((budget+((tmp>>6U)>>1U))/(tmp>>6U))-1U;while(val&0xFFFFFF00U){val>>=1U;exp++;}return w16(c,REG_RANGE_CONFIG_B,(uint16_t)((exp<<8U)|(val&0xFFU)));}
static int sensor_init(vl53l4cd_ctx_t*c){uint16_t id;uint8_t fw;TRY(r16(c,REG_MODEL_ID,&id));if(id!=VL53L4CD_MODEL_ID){LOG_ERR("id_check FAIL expected=0x%04X got=0x%04X",VL53L4CD_MODEL_ID,id);return ERR_VL53L4CD_ID_MISMATCH;}for(uint32_t i=0;i<1000U;i++){TRY(r8(c,REG_FIRMWARE_STATUS,&fw));if(fw==3U)break;if(i==999U)return ERR_TIMEOUT;delay_ms(1U);}TRY(write_data(c,0x002DU,s_default_config,sizeof(s_default_config)));TRY(w8(c,REG_SYSTEM_START,0x40U));TRY(wait_ready(c,1000U));TRY(w8(c,REG_INTERRUPT_CLEAR,1U));TRY(w8(c,REG_SYSTEM_START,0U));TRY(w8(c,REG_VHV_TIMEOUT,9U));TRY(w8(c,0x000BU,0U));TRY(w16(c,0x0024U,0x0500U));TRY(set_timing(c,50U));TRY(w32(c,REG_INTERMEASUREMENT,0U));TRY(w8(c,REG_SYSTEM_START,0x21U));TRY(wait_ready(c,1000U));return w8(c,REG_INTERRUPT_CLEAR,1U);}
int vl53l4cd_init(vl53l4cd_handle_t*h,const vl53l4cd_cfg_t*cfg){vl53l4cd_ctx_t*c=NULL;bool found=false;if(!h||!cfg||cfg->i2c_addr!=0x29U||!cfg->bridge_timeout_ms||!cfg->data_ready_timeout_ms||valid_node(cfg->ch32_node))return ERR_INVALID_PARAM;*h=NULL;for(size_t i=0;i<VL53L4CD_MAX_BRIDGE_INSTANCES;i++)if(!s_instances[i].in_use){c=&s_instances[i];break;}if(!c)return ERR_BUSY;memset(c,0,sizeof(*c));c->in_use=true;c->node=cfg->ch32_node;c->addr=cfg->i2c_addr;c->bridge_timeout_ms=cfg->bridge_timeout_ms;c->ready_timeout_ms=cfg->data_ready_timeout_ms;ch32_i2c_multi_result_t g=ch32_i2c_multi_set_speed_400k(c->node);if(g==CH32_I2C_MULTI_RESULT_OK)g=ch32_i2c_multi_probe(c->node,c->addr,&found);if(g!=CH32_I2C_MULTI_RESULT_OK||!found){int r=g==CH32_I2C_MULTI_RESULT_OK?ERR_NO_DEVICE:map_gateway(g);memset(c,0,sizeof(*c));return r;}int r=sensor_init(c);if(r){LOG_ERR("module init FAIL token=0x%04X node=%u err=%d",c->node->token,c->node->node_id,r);memset(c,0,sizeof(*c));return r;}c->initialized=true;*h=c;LOG_INF("init OK addr=0x29 id=0xEBAA token=0x%04X node=%u",c->node->token,c->node->node_id);return 0;}
int vl53l4cd_deinit(vl53l4cd_handle_t h){if(!h||!h->initialized)return ERR_NOT_INIT;int r=w8(h,REG_SYSTEM_START,0U);LOG_INF("deinit %s token=0x%04X node=%u",r==0?"OK":"FAIL",h->node->token,h->node->node_id);memset(h,0,sizeof(*h));return r;}
int vl53l4cd_read(vl53l4cd_handle_t h,vl53l4cd_result_t*out){static const uint8_t map[24]={255,255,255,5,2,4,1,7,3,0,255,255,9,13,255,255,255,255,10,6,255,255,11,12};uint8_t raw;uint16_t d;if(!h||!out)return ERR_INVALID_PARAM;if(!h->initialized)return ERR_NOT_INIT;memset(out,0,sizeof(*out));TRY(wait_ready(h,h->ready_timeout_ms));TRY(r8(h,REG_RANGE_STATUS,&raw));TRY(r16(h,REG_DISTANCE,&d));TRY(w8(h,REG_INTERRUPT_CLEAR,1U));raw&=0x1FU;out->range_status=raw<24U?map[raw]:255U;out->distance_mm=d;out->valid=out->range_status==0U&&d<=VL53L4CD_RANGE_MAX_MM;out->out_of_range=!out->valid;return out->valid?0:ERR_VL53L4CD_OUT_OF_RANGE;}
